{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "name": "input_1", "sparse": false, "dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "config": {"trainable": false, "input_length": 20, "mask_zero": false, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "activity_regularizer": null, "output_dim": 200, "batch_input_shape": [null, 20], "embeddings_constraint": null, "input_dim": 20000, "name": "embedding_1", "dtype": "float32"}, "name": "embedding_1"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_1", "layer": {"config": {"recurrent_dropout": 0.0, "kernel_constraint": null, "stateful": false, "unroll": false, "use_bias": true, "return_state": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "implementation": 1, "name": "lstm_1", "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.0, "return_sequences": false, "units": 300, "trainable": true, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, "trainable": true}, "name": "bidirectional_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "name": "input_2", "sparse": false, "dtype": "float32"}, "name": "input_2"}, {"inbound_nodes": [[["bidirectional_1", 0, 1, {}], ["bidirectional_1", 0, 3, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1"}, {"inbound_nodes": [[["bidirectional_1", 0, 2, {}], ["bidirectional_1", 0, 4, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["concatenate_1", 0, 0, {}], ["concatenate_2", 0, 0, {}]]], "class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "kernel_constraint": null, "stateful": false, "unroll": false, "use_bias": true, "return_state": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "implementation": 1, "name": "lstm_2", "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.0, "return_sequences": true, "units": 600, "trainable": true, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "name": "lstm_2"}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "units": 4, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model"}