{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.0", "config": {"output_layers": [["policy_head_dense", 0, 0], ["value_head_output", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 19, 19], "name": "input_4"}}, {"class_name": "Conv2D", "name": "init_conv_block", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "init_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "init_batch_norm", "inbound_nodes": [[["init_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "init_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "init_relu", "inbound_nodes": [[["init_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "init_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "0_conv_block", "inbound_nodes": [[["init_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "0_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "0_batch_norm", "inbound_nodes": [[["0_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "0_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "0_relu", "inbound_nodes": [[["0_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "0_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "1_conv_block", "inbound_nodes": [[["0_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "1_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "1_batch_norm", "inbound_nodes": [[["1_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "1_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "1_relu", "inbound_nodes": [[["1_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "1_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "2_conv_block", "inbound_nodes": [[["1_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "2_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "2_batch_norm", "inbound_nodes": [[["2_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "2_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "2_relu", "inbound_nodes": [[["2_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "2_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "3_conv_block", "inbound_nodes": [[["2_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "3_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "3_batch_norm", "inbound_nodes": [[["3_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "3_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "3_relu", "inbound_nodes": [[["3_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "3_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "4_conv_block", "inbound_nodes": [[["3_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "4_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "4_batch_norm", "inbound_nodes": [[["4_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "4_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "4_relu", "inbound_nodes": [[["4_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "4_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "5_conv_block", "inbound_nodes": [[["4_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "5_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "5_batch_norm", "inbound_nodes": [[["5_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "5_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "5_relu", "inbound_nodes": [[["5_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "5_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "6_conv_block", "inbound_nodes": [[["5_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "6_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "6_batch_norm", "inbound_nodes": [[["6_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "6_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "6_relu", "inbound_nodes": [[["6_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "6_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "7_conv_block", "inbound_nodes": [[["6_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "7_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "7_batch_norm", "inbound_nodes": [[["7_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "7_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "7_relu", "inbound_nodes": [[["7_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "7_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "8_conv_block", "inbound_nodes": [[["7_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "8_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "8_batch_norm", "inbound_nodes": [[["8_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "8_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "8_relu", "inbound_nodes": [[["8_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "8_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "9_conv_block", "inbound_nodes": [[["8_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "9_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "9_batch_norm", "inbound_nodes": [[["9_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "9_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "9_relu", "inbound_nodes": [[["9_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "9_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "10_conv_block", "inbound_nodes": [[["9_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "10_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "10_batch_norm", "inbound_nodes": [[["10_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "10_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "10_relu", "inbound_nodes": [[["10_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "10_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "11_conv_block", "inbound_nodes": [[["10_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "11_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "11_batch_norm", "inbound_nodes": [[["11_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "11_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "11_relu", "inbound_nodes": [[["11_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "11_relu", "trainable": true}}, {"class_name": "Conv2D", "name": "value_head_conv_block", "inbound_nodes": [[["11_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 1, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "value_head_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "policy_head_conv_block", "inbound_nodes": [[["11_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 2, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "policy_head_conv_block", "padding": "same", "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "value_head_batch_norm", "inbound_nodes": [[["value_head_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "value_head_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "BatchNormalization", "name": "policy_head_batch_norm", "inbound_nodes": [[["policy_head_conv_block", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "policy_head_batch_norm", "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "trainable": true, "center": true}}, {"class_name": "Activation", "name": "value_head_relu", "inbound_nodes": [[["value_head_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "value_head_relu", "trainable": true}}, {"class_name": "Activation", "name": "policy_head_relu", "inbound_nodes": [[["policy_head_batch_norm", 0, 0, {}]]], "config": {"activation": "relu", "name": "policy_head_relu", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_6", "inbound_nodes": [[["value_head_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_6", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_5", "inbound_nodes": [[["policy_head_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "name": "value_head_dense", "inbound_nodes": [[["flatten_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 256, "name": "value_head_dense", "bias_constraint": null, "trainable": true}}, {"class_name": "Dense", "name": "policy_head_dense", "inbound_nodes": [[["flatten_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 362, "name": "policy_head_dense", "bias_constraint": null, "trainable": true}}, {"class_name": "Dense", "name": "value_head_output", "inbound_nodes": [[["value_head_dense", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "units": 1, "name": "value_head_output", "bias_constraint": null, "trainable": true}}]}}